In [2]:
# %load imports.py
import numpy as np
import scipy as sp
import pandas as pd
import matplotlib.pyplot as plt
import matplotlib as mpl
%matplotlib inline
import seaborn as sns
sns.set()

In [3]:
df = pd.read_csv('../DATA/sales_records.csv')
df

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost
0,Central America and the Caribbean,Antigua and Barbuda,Baby Food,Online,M,12/20/2013,957081544,1/11/2014,552,255.28,159.42
1,Central America and the Caribbean,Panama,Snacks,Offline,C,7/5/2010,301644504,7/26/2010,2167,152.58,97.44
2,Europe,Czech Republic,Beverages,Offline,C,9/12/2011,478051030,9/29/2011,4778,47.45,31.79
3,Asia,North Korea,Cereal,Offline,L,5/13/2010,892599952,6/15/2010,9016,205.70,117.11
4,Asia,Sri Lanka,Snacks,Offline,C,7/20/2015,571902596,7/27/2015,7542,152.58,97.44
...,...,...,...,...,...,...,...,...,...,...,...
4995,Australia and Oceania,New Zealand,Household,Offline,C,4/3/2015,217984473,4/20/2015,5305,668.27,502.54
4996,Middle East and North Africa,Azerbaijan,Clothes,Offline,L,8/17/2014,169748055,10/2/2014,1077,109.28,35.84
4997,Asia,Myanmar,Baby Food,Offline,H,11/23/2016,226939189,12/10/2016,5204,255.28,159.42
4998,Europe,Finland,Clothes,Online,L,4/22/2014,906794202,5/11/2014,9410,109.28,35.84
4999,Sub-Saharan Africa,Tanzania,Vegetables,Online,L,7/8/2011,996861922,8/7/2011,2450,154.06,90.93

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Region          5000 non-null   object
 1   Country         5000 non-null   object
 2   Item Type       5000 non-null   object
 3   Sales Channel   5000 non-null   object
 4   Order Priority  5000 non-null   object
 5   Order Date      5000 non-null   object
 6   Order ID        5000 non-null   int64
 7   Ship Date       5000 non-null   object
 8   Units Sold      5000 non-null   int64
 9   Unit Price      5000 non-null   float64
 10  Unit Cost       5000 non-null   float64
dtypes: float64(2), int64(2), object(7)
memory usage: 429.8+ KB

In [5]:
df['Profit'] = df['Units Sold'] * (df['Unit Price'] - df['Unit Cost'])
df.head()

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Profit
0,Central America and the Caribbean,Antigua and Barbuda,Baby Food,Online,M,12/20/2013,957081544,1/11/2014,552,255.28,159.42,52914.72
1,Central America and the Caribbean,Panama,Snacks,Offline,C,7/5/2010,301644504,7/26/2010,2167,152.58,97.44,119488.38
2,Europe,Czech Republic,Beverages,Offline,C,9/12/2011,478051030,9/29/2011,4778,47.45,31.79,74823.48
3,Asia,North Korea,Cereal,Offline,L,5/13/2010,892599952,6/15/2010,9016,205.70,117.11,798727.44
4,Asia,Sri Lanka,Snacks,Offline,C,7/20/2015,571902596,7/27/2015,7542,152.58,97.44,415865.88

In [6]:
pd.options.display.float_format = '{:.2f}'.format
regions = df.groupby('Region')
profit_by_region = regions.sum().sort_values(by="Profit", ascending=False)
profit_by_region

,Order ID,Units Sold,Unit Price,Unit Cost,Profit
Region,,,,,
Sub-Saharan Africa,714129889652,6642380,349025.54,246882.89,531142267.92
Europe,719802331123,6582322,352308.41,249038.26,501676048.32
Asia,397456711807,3620036,183556.72,128579.21,278237661.69
Middle East and North Africa,329477662194,3013431,157454.57,110155.63,231380300.53
Central America and the Caribbean,295473045677,2698776,138441.97,97945.33,204611979.72
Australia and Oceania,233075865831,2111786,116833.27,82580.72,174934572.94
North America,53808179824,484760,31107.34,22288.68,41240397.97

In [25]:
profit_by_region.style.highlight_max(['Profit','Units Sold', 'Unit Price', 'Unit Cost'])

In [22]:
profit_by_region.index

Index(['Sub-Saharan Africa', 'Europe', 'Asia', 'Middle East and North Africa',
       'Central America and the Caribbean', 'Australia and Oceania',
       'North America'],
      dtype='object', name='Region')

In [26]:
profit_by_region.index = ['A', 'B', 'C', 'D', 'E', 'F', 'G']
profit_by_region.columns = ['alpha', 'beta', 'gamma', 'delta', 'epsilon']
profit_by_region

          alpha     beta     gamma     delta      epsilon
A  714129889652  6642380 349025.54 246882.89 531142267.92
B  719802331123  6582322 352308.41 249038.26 501676048.32
C  397456711807  3620036 183556.72 128579.21 278237661.69
D  329477662194  3013431 157454.57 110155.63 231380300.53
E  295473045677  2698776 138441.97  97945.33 204611979.72
F  233075865831  2111786 116833.27  82580.72 174934572.94
G   53808179824   484760  31107.34  22288.68  41240397.97